### LSE Data Analytics Online Career Accelerator 

# DA201:  Data Analytics with Python

## Using aggregate functions on grouped data (tutorial video)

This file contains the code snippets that are introduced in the Using aggregate functions on grouped data video. 
Follow along with the demonstration to:
- use the aggregate method as an operation on grouped data.

Play and pause the video to follow along with the demonstration.

Note: Steps 1 to 3 you completed in the demonstration video in '3.1.6 Introduction to groupby()'. These steps need to be run to complete this demonstration. The new code begins in Step 4.

### 1. Import pandas and create a DataFrame

In [1]:
# Import Pandas.
import pandas as pd

# Read CSV files from the current working directory
classlist_a = pd.read_csv('classlist_a.csv')
classlist_b = pd.read_csv('classlist_b.csv')
classlist_c = pd.read_csv('classlist_c.csv')
classlist_d = pd.read_csv('classlist_d.csv')

# Print the shape of each DataFrame.
print(classlist_a.shape)
print(classlist_b.shape)
print(classlist_c.shape)
print(classlist_d.shape)

# Merge four DataFrames into one DataFrame.
classlist_final = pd.concat([classlist_a, classlist_b,
                             classlist_c, classlist_d]) 

# View the DataFrame.
classlist_final.shape

(145, 5)
(126, 5)
(185, 5)
(219, 5)

(675, 5)

### 2. Split data to create groups

In [2]:
# Create group 1.
group_surname = classlist_final.groupby('Surname')

# View the DataFrame.
group_surname

In [3]:
# Create group 2.
group_marks = classlist_final.groupby('Final mark')

# View the DataFrame.
group_marks

In [4]:
# Create group 3.
group_surname_marks = classlist_final.groupby(['Surname', 'Final mark'])

# View the DataFrame.
group_surname_marks

### 3. Create a criteria

In [5]:
# Create splitting within groups.
group_surname_marks.sum()

                                           Student number
Surname                        Final mark
ABRAHAMS                       48.00             15793648
ACKERMANN                      45.00             17483638
ADENDORFF                      76.50             15849376
AFONSO                         47.72             15476227
ALBERTUS                       57.00             16564499
...                                                   ...
YOUNG                          88.05             15849390
ZINN                           74.00             17094607
ZONDAGH                        59.10             15897184
ZONDI                          74.46             16324773
ZUMA                           64.50             16782879

[673 rows x 1 columns]

### 4. Determine the group sizes (option 1)

In [6]:
# Use the size() function on the marks column.
group_surname_marks.size()

Surname                         Final mark
ABRAHAMS                        48.00         1
ACKERMANN                       45.00         1
ADENDORFF                       76.50         1
AFONSO                          47.72         1
ALBERTUS                        57.00         1
                                             ..
YOUNG                           88.05         1
ZINN                            74.00         1
ZONDAGH                         59.10         1
ZONDI                           74.46         1
ZUMA                            64.50         1
Length: 673, dtype: int64

In [7]:
# Use the size() function on the surname column.
group_surname.size()

Surname
ABRAHAMS                          1
ACKERMANN                         1
ADENDORFF                         1
AFONSO                            1
ALBERTUS                          1
                                 ..
YOUNG                             1
ZINN                              1
ZONDAGH                           1
ZONDI                             1
ZUMA                              1
Length: 534, dtype: int64

### 5. Determine group sizes (option 2)

In [8]:
# Create a group based on initials.
group_initials = classlist_final.groupby('Initials')

# Create group_surname_initials based on the surname and intials columns.
group_surname_initials = classlist_final.groupby(['Surname', 'Initials'])

# Find group size based on the initials and surname columns
group_surname_initials.size()

Surname                         Initials
ABRAHAMS                        B             1
ACKERMANN                       E             1
ADENDORFF                       K             1
AFONSO                          L             1
ALBERTUS                        S             1
                                             ..
YOUNG                           V A           1
ZINN                            A             1
ZONDAGH                         L             1
ZONDI                           WP            1
ZUMA                            MC            1
Length: 666, dtype: int64

### 6. Determine group size using the count() function

In [9]:
# Use the count() function.
group_surname_initials.count()

                                           Student number  Final mark  Class
Surname                        Initials
ABRAHAMS                       B                        1           1      1
ACKERMANN                      E                        1           1      1
ADENDORFF                      K                        1           1      1
AFONSO                         L                        1           1      1
ALBERTUS                       S                        1           1      1
...                                                   ...         ...    ...
YOUNG                          V A                      1           1      1
ZINN                           A                        1           1      1
ZONDAGH                        L                        1           1      1
ZONDI                          WP                       1           1      1
ZUMA                           MC                       1           1      1

[666 rows x 3 columns]